<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>PayloadContent</key>
    <array>
      <dict>
        <key>PayloadType</key>
        <string>com.shadowrocket.config</string>
        <key>PayloadVersion</key>
        <integer>1</integer>
        <key>PayloadIdentifier</key>
        <string>com.popdeuxrem.shadowrocket.config</string>
        <key>PayloadUUID</key>
        <string>7f8a3215-7d2c-4ff6-8eb7-d3827da4b4c7</string>
        <key>PayloadEnabled</key>
        <true/>
        <key>PayloadDisplayName</key>
        <string>Shadowrocket Auto Config</string>
        <key>PayloadDescription</key>
        <string>Auto-install proxy config with MITM, DNS, routing rules.</string>
        <key>dns</key>
        <string>1.1.1.1</string>
        <key>proxies</key>
        <array>
          <dict>
            <key>type</key>
            <string>vless</string>
            <key>name</key>
            <string>VLESS-JANTIT-US1</string>
            <key>host</key>
            <string>premiusa1.vpnjantit.com</string>
            <key>port</key>
            <integer>10002</integer>
            <key>user</key>
            <string>210fc54a-7ebd-11f0-92b9-072f1c489945</string>
            <key>tls</key>
            <true/>
            <key>ws</key>
            <true/>
            <key>ws-path</key>
            <string>/vpnjantit</string>
          </dict>
          <dict>
            <key>type</key>
            <string>http</string>
            <key>name</key>
            <string>HTTP-LONG-BEACH-US1</string>
            <key>host</key>
            <string>40.160.11.234</string>
            <key>port</key>
            <integer>8000</integer>
            <key>user</key>
            <string>2yaw2lis_gmail_com</string>
            <key>pass</key>
            <string>Qwerty6699-country-US-region-california-city-long_beach-session-FaQRnIB4</string>
          </dict>
          <dict>
            <key>type</key>
            <string>socks5</string>
            <key>name</key>
            <string>SOCKS5-US1</string>
            <key>host</key>
            <string>YOUR_SOCKS5_HOST</string>
            <key>port</key>
            <integer>1080</integer>
            <key>user</key>
            <string>USERNAME</string>
            <key>pass</key>
            <string>PASSWORD</string>
          </dict>
          <dict>
            <key>type</key>
            <string>http</string>
            <key>name</key>
            <string>HTTP-US1</string>
            <key>host</key>
            <string>YOUR_HTTP_HOST</string>
            <key>port</key>
            <integer>8080</integer>
            <key>user</key>
            <string>USERNAME</string>
            <key>pass</key>
            <string>PASSWORD</string>
          </dict>
          <dict>
            <key>type</key>
            <string>vless</string>
            <key>name</key>
            <string>VLESS-US1</string>
            <key>host</key>
            <string>YOUR_VLESS_HOST</string>
            <key>port</key>
            <integer>443</integer>
            <key>tls</key>
            <true/>
            <key>ws</key>
            <true/>
            <key>servername</key>
            <string>YOUR_DOMAIN</string>
          </dict>
        </array>
        <key>proxy-groups</key>
        <array>
          <dict>
            <key>name</key>
            <string>US</string>
            <key>type</key>
            <string>select</string>
            <key>proxies</key>
            <array>
              <string>VLESS-JANTIT-US1</string>
              <string>SOCKS5-US1</string>
              <string>HTTP-US1</string>
              <string>HTTP-LONG-BEACH-US1</string>
            </array>
          </dict>
        </array>
        <key>rules</key>
        <array>
          <string>DOMAIN-SUFFIX,paypal.com,US</string>
          <string>DOMAIN-SUFFIX,cash.app,US</string>
          <string>DOMAIN-SUFFIX,venmo.com,US</string>
          <string>DOMAIN-SUFFIX,wise.com,US</string>
          <string>DOMAIN-SUFFIX,stripe.com,US</string>
          <string>DOMAIN-SUFFIX,link.com,US</string>
          <string>DOMAIN-SUFFIX,moonpay.com,US</string>
          <string>DOMAIN-SUFFIX,textnow.com,US</string>
          <string>DOMAIN-SUFFIX,burnerapp.com,US</string>
          <string>DOMAIN-SUFFIX,getsly.com,US</string>
          <string>DOMAIN-SUFFIX,slyphone.com,US</string>
          <string>DOMAIN-SUFFIX,facebook.com,US</string>
          <string>DOMAIN-SUFFIX,instagram.com,US</string>
          <string>DOMAIN-SUFFIX,twitter.com,US</string>
          <string>DOMAIN-SUFFIX,x.com,US</string>
          <string>DOMAIN-SUFFIX,snapchat.com,US</string>
          <string>DOMAIN-SUFFIX,discord.com,US</string>
          <string>DOMAIN-SUFFIX,telegram.org,US</string>
          <string>DOMAIN-SUFFIX,t.me,US</string>
          <string>DOMAIN-SUFFIX,tiktok.com,US</string>
          <string>DOMAIN-SUFFIX,youtube.com,US</string>
          <string>DOMAIN-SUFFIX,netflix.com,US</string>
          <string>DOMAIN-SUFFIX,disneyplus.com,US</string>
          <string>DOMAIN-SUFFIX,primevideo.com,US</string>
          <string>DOMAIN-SUFFIX,spotify.com,US</string>
          <string>DOMAIN-KEYWORD,stun,US</string>
          <string>DOMAIN-KEYWORD,turn,US</string>
          <string>DOMAIN-SUFFIX,webrtc.org,US</string>
          <string>DOMAIN-SUFFIX,manus.ai,US</string>
          <string>DOMAIN,api.manus.ai,US</string>
          <string>DOMAIN,ws.manus.ai,US</string>
          <string>DOMAIN,cdn.manus.ai,US</string>
          <string>DOMAIN,assets.manus.ai,US</string>
          <string>DOMAIN,static.manus.ai,US</string>
          <string>DOMAIN,www.manus.ai,US</string>
          <string>DOMAIN-SUFFIX,talkroom.com,US</string>
          <string>DOMAIN-SUFFIX,talkroom.co,US</string>
          <string>DOMAIN,api.talkroom.com,US</string>
          <string>DOMAIN,websocket.talkroom.com,US</string>
          <string>DOMAIN-SUFFIX,cdn.talkroom.com,US</string>
          <string>DOMAIN-SUFFIX,assets.talkroom.com,US</string>
          <string>DOMAIN-SUFFIX,hostinger.com,US</string>
          <string>DOMAIN-SUFFIX,payments.hostinger.com,US</string>
          <string>DOMAIN-SUFFIX,api.hostinger.com,US</string>
          <string>DOMAIN-SUFFIX,static.hostinger.com,US</string>
          <string>DOMAIN,apple-pay-gateway.apple.com,US</string>
          <string>DOMAIN,apple-pay-gateway-nc.apple.com,US</string>
          <string>DOMAIN,apple-pay-gateway-pr.apple.com,US</string>
          <string>DOMAIN,apple-pay-gateway-cert.apple.com,US</string>
          <string>DOMAIN-SUFFIX,apple.com,US</string>
          <string>DOMAIN-SUFFIX,pay.google.com,US</string>
          <string>DOMAIN-SUFFIX,payments.google.com,US</string>
          <string>DOMAIN-SUFFIX,googleapis.com,US</string>
          <string>DOMAIN-SUFFIX,gstatic.com,US</string>
          <string>DOMAIN-SUFFIX,js.stripe.com,US</string>
          <string>DOMAIN-SUFFIX,stripe.network,US</string>
          <string>DOMAIN-SUFFIX,checkout.stripe.com,US</string>
          <string>DOMAIN-SUFFIX,braintreegateway.com,US</string>
          <string>DOMAIN-SUFFIX,adyen.com,US</string>
          <string>DOMAIN-SUFFIX,adyenpayments.com,US</string>
          <string>DOMAIN-SUFFIX,burnerapp.com,US</string>
          <string>DOMAIN,api.burnerapp.com,US</string>
          <string>DOMAIN,cdn.burnerapp.com,US</string>
          <string>DOMAIN,static.burnerapp.com,US</string>
          <string>DOMAIN,assets.burnerapp.com,US</string>
          <string>DOMAIN,ws.burnerapp.com,US</string>
          <string>DOMAIN-SUFFIX,stripe.com,US</string>
          <string>DOMAIN-SUFFIX,stripe.network,US</string>
          <string>DOMAIN-SUFFIX,js.stripe.com,US</string>
          <string>DOMAIN-SUFFIX,checkout.stripe.com,US</string>
          <string>DOMAIN-SUFFIX,r.stripe.com,REJECT</string>
          <string>DOMAIN-SUFFIX,m.stripe.com,REJECT</string>
          <string>DOMAIN-SUFFIX,metrics.stripe.com,REJECT</string>
          <string>DOMAIN-SUFFIX,firebaseinstallations.googleapis.com,US</string>
          <string>DOMAIN-SUFFIX,firebaseio.com,US</string>
          <string>DOMAIN-SUFFIX,fcm.googleapis.com,US</string>
          <string>DOMAIN-SUFFIX,googleapis.com,US</string>
          <string>DOMAIN-SUFFIX,gstatic.com,US</string>
          <string>DOMAIN-SUFFIX,twilio.com,US</string>
          <string>DOMAIN-KEYWORD,stun,US</string>
          <string>DOMAIN-KEYWORD,turn,US</string>
          <string>DOMAIN-SUFFIX,webrtc.org,US</string>
          <string>DOMAIN-SUFFIX,recaptcha.net,US</string>
          <string>DOMAIN-SUFFIX,hcaptcha.com,US</string>
          <string>DOMAIN-SUFFIX,cloudflare.com,US</string>
          <string>DOMAIN-SUFFIX,cloudfront.net,US</string>
          <string>DOMAIN-SUFFIX,google-analytics.com,REJECT</string>
          <string>DOMAIN-SUFFIX,doubleclick.net,REJECT</string>
          <string>DOMAIN-SUFFIX,appsflyer.com,REJECT</string>
          <string>DOMAIN-SUFFIX,adjust.com,REJECT</string>
          <string>DOMAIN-SUFFIX,facebook.net,REJECT</string>
          <string>DOMAIN-SUFFIX,logrocket.io,REJECT</string>
          <string>GEOIP,US,US</string>
          <string>RULE-SET,https://raw.githubusercontent.com/dlisin/shadowrocket-config/master/domains/openai.list,US</string>
          <string>RULE-SET,https://raw.githubusercontent.com/dlisin/shadowrocket-config/master/domains/discord.list,US</string>
          <string>RULE-SET,https://raw.githubusercontent.com/dlisin/shadowrocket-config/master/domains/facebook.list,US</string>
          <string>RULE-SET,https://raw.githubusercontent.com/dlisin/shadowrocket-config/master/domains/github.list,US</string>
          <string>RULE-SET,https://raw.githubusercontent.com/dlisin/shadowrocket-config/master/domains/instagram.list,US</string>
          <string>RULE-SET,https://raw.githubusercontent.com/dlisin/shadowrocket-config/master/domains/jetbrains.list,US</string>
          <string>RULE-SET,https://raw.githubusercontent.com/dlisin/shadowrocket-config/master/domains/linkedin.list,US</string>
          <string>RULE-SET,https://raw.githubusercontent.com/dlisin/shadowrocket-config/master/domains/medium.list,US</string>
          <string>RULE-SET,https://raw.githubusercontent.com/dlisin/shadowrocket-config/master/domains/openai.list,US</string>
          <string>RULE-SET,https://raw.githubusercontent.com/dlisin/shadowrocket-config/master/domains/pornhub.list,US</string>
          <string>RULE-SET,https://raw.githubusercontent.com/dlisin/shadowrocket-config/master/domains/reddit.list,US</string>
          <string>RULE-SET,https://raw.githubusercontent.com/dlisin/shadowrocket-config/master/domains/redis.list,US</string>
          <string>RULE-SET,https://raw.githubusercontent.com/dlisin/shadowrocket-config/master/domains/telegram.list,US</string>
          <string>RULE-SET,https://raw.githubusercontent.com/dlisin/shadowrocket-config/master/domains/twitter.list,US</string>
          <string>RULE-SET,https://raw.githubusercontent.com/dlisin/shadowrocket-config/master/domains/whatsapp.list,US</string>
          <string>RULE-SET,https://raw.githubusercontent.com/dlisin/shadowrocket-config/master/domains/xvideos.list,US</string>
          <string>RULE-SET,https://raw.githubusercontent.com/dlisin/shadowrocket-config/master/domains/youtube.list,US</string>
          <string>DOMAIN-SUFFIX,google-analytics.com,REJECT</string>
          <string>DOMAIN-SUFFIX,doubleclick.net,REJECT</string>
          <string>DOMAIN-SUFFIX,appsflyer.com,REJECT</string>
          <string>DOMAIN-SUFFIX,adjust.com,REJECT</string>
          <string>DOMAIN-SUFFIX,facebook.net,REJECT</string>
          <string>DOMAIN-SUFFIX,logrocket.io,REJECT</string>
          <string>DOMAIN-SUFFIX,metrics.stripe.com,REJECT</string>
          <string>DOMAIN-SUFFIX,r.stripe.com,REJECT</string>
          <string>DOMAIN-SUFFIX,m.stripe.com,REJECT</string>
          <string>FINAL,US</string>
        </array>
        <key>mitm</key>
        <dict>
          <key>enabled</key>
          <true/>
          <key>hostnames</key>
          <array>
            <string>*.paypal.com</string>
            <string>*.snapchat.com</string>
            <string>*.openai.com</string>
            <string>*.binance.com</string>
            <string>*.wise.com</string>
            <string>*.tiktok.com</string>
            <string>*.instagram.com</string>
            <string>*.claude.ai</string>
            <string>*.api.anthropic.com</string>
            <string>*.telegram.org</string>
            <string>*.gemini.com</string>
            <string>*.trustwallet.com</string>
            <string>*.metamask.io</string>
            <string>*.phantom.app</string>
            <string>*.stripe.com</string>
            <string>*.moonpay.com</string>
            <string>*.textnow.com</string>
          </array>
        </dict>
        <key>script</key>
        <dict>
          <key>http_response</key>
          <string>^https?:\/\/.+</string>
          <key>script_path</key>
          <string>https://popdeuxrem.github.io/shadow-scripts/scripts/mitm-loader.js</string>
        </dict>
      </dict>
    </array>
    <key>PayloadType</key>
    <string>Configuration</string>
    <key>PayloadVersion</key>
    <integer>1</integer>
    <key>PayloadIdentifier</key>
    <string>com.popdeuxrem.shadowrocket</string>
    <key>PayloadUUID</key>
    <string>51ce827a-824e-4a91-a477-9f0ec360a847</string>
    <key>PayloadDisplayName</key>
    <string>Shadowrocket Auto Config</string>
    <key>PayloadDescription</key>
    <string>Auto-install proxy config with MITM, DNS, routing rules.</string>
    <key>PayloadOrganization</key>
    <string>PopDeuxRem Scripts</string>
  </dict>
</plist>