<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>PayloadContent</key>
    <array>
      <dict>
        <key>PayloadDescription</key>
        <string>Configures DNS for stealth proxy/DoH on iOS.</string>
        <key>PayloadDisplayName</key>
        <string>Stealth DNS/Proxy</string>
        <key>PayloadIdentifier</key>
        <string>com.shadow.7286F40A-3793-4F16-B832-B119220C3047</string>
        <key>PayloadType</key>
        <string>com.apple.dnsSettings.managed</string>
        <key>PayloadUUID</key>
        <string>7286F40A-3793-4F16-B832-B119220C3047</string>
        <key>PayloadVersion</key>
        <integer>1</integer>
        <key>DNSSettings</key>
        <dict>
          <key>ServerAddresses</key>
          <array>
            <string>1.1.1.1</string>
          </array>
        </dict>
      </dict>
    </array>
    <key>PayloadDisplayName</key>
    <string>Stealth DNS/Proxy</string>
    <key>PayloadIdentifier</key>
    <string>com.shadow.7286F40A-3793-4F16-B832-B119220C3047</string>
    <key>PayloadRemovalDisallowed</key>
    <false/>
    <key>PayloadType</key>
    <string>Configuration</string>
    <key>PayloadUUID</key>
    <string>7286F40A-3793-4F16-B832-B119220C3047</string>
    <key>PayloadVersion</key>
    <integer>1</integer>
  </dict>
</plist>